STMicroelectronics/STM32CubeWB0/Projects/NUCLEO-WB09KE/Applications/BLE/BLE_p2pClient_Ext/STM32_BLE/App/app_ble.c
            bleAppContext.deviceServerFound = 0x01;
          }
        }
        i += adlength + 1;
      }
    }

    l_buff_pos += snprintf(&l_buff[l_buff_pos], L_BUFF_SIZE - l_buff_pos, "\n");
   
    APP_DBG_MSG("%s",l_buff);
  }
    
  return status;
}

static void connectRequestExt(void)
{
  tBleStatus result;
  
  if (bleAppContext.deviceServerFound != 0x00)
  {    
    APP_DBG_MSG("aci_gap_set_connection_configuration\n");
    
    result = aci_gap_set_connection_configuration(LE_1M_PHY_BIT,
                                                  CONN_INT_MS(50u), CONN_INT_MS(100u),
                                                  0u,
                                                  CONN_SUP_TIMEOUT_MS(5000u),
                                                  CONN_CE_LENGTH_MS(10u), CONN_CE_LENGTH_MS(10u));
    
    if (result == BLE_STATUS_SUCCESS)
    {
      APP_DBG_MSG("==>> aci_gap_set_connection_configuration Success , result: 0x%02x\n", result);
    }
    else
    {
      APP_DBG_MSG("==>> aci_gap_set_connection_configuration Failed , result: 0x%02x\n", result);
    }  
    
    APP_DBG_MSG("aci_gap_create_connection\n");  
    result = aci_gap_create_connection(LE_1M_PHY_BIT,
                                       bleAppContext.deviceServerAddressType,
                                       &bleAppContext.a_deviceServeAddr[0]);    
    if (result == BLE_STATUS_SUCCESS)
    {
      bleAppContext.Device_Connection_Status = APP_BLE_LP_CONNECTING;
    }
    else
    {
      APP_DBG_MSG("==>> GAP Create connection Failed , result: 0x%02x\n", result);
      bleAppContext.Device_Connection_Status = APP_BLE_IDLE;
    }
  }

  return;
}

/* USER CODE END FD_LOCAL_FUNCTION */

/* USER CODE BEGIN FD_WRAP_FUNCTIONS */
#if (CFG_BUTTON_SUPPORTED == 1)
void APPE_Button1Action(void)
{
  if (bleAppContext.Device_Connection_Status != APP_BLE_CONNECTED_CLIENT)
  {
    if (scan_running == 1)
    {
      APP_BLE_Procedure_Gap_Central(PROC_GAP_CENTRAL_SCAN_TERMINATE);
      scan_running = 0;
    }
    else
    {
      APP_BLE_Procedure_Gap_Central(PROC_GAP_CENTRAL_SCAN_START);
      scan_running = 1;
    }
  }
  else
  {
    UTIL_SEQ_SetTask( 1u << CFG_TASK_P2PC_WRITE_CHAR_ID, CFG_SEQ_PRIO_0);
  }

  return;
}

void APPE_Button2Action(void)
{
  display_filter = !display_filter;
  
  return;
}

void APPE_Button3Action(void)
{
  if(bleAppContext.Device_Connection_Status != APP_BLE_CONNECTED_CLIENT)
  {
    if (scan_running == 1)
    {
      APP_BLE_Procedure_Gap_Central(PROC_GAP_CENTRAL_SCAN_TERMINATE);
      scan_running = 0;
    }
    UTIL_SEQ_SetTask(1u << CFG_TASK_CONN_REQ_EXT_DEV_ID, CFG_SEQ_PRIO_0);
  }
  else
  {
    APP_DBG_MSG("==>> Device already connected\n");
  }
  
  return;
}
#endif /* (CFG_BUTTON_SUPPORTED == 1) */
/* USER CODE END FD_WRAP_FUNCTIONS */

/** \endcond
 */
